bnovkov/freebsd-src/usr.sbin/bhyvectl/bhyvectl.8
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2015 Christian Brueffer
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 1, 2026
.Dt BHYVECTL 8
.Os
.Sh NAME
.Nm bhyvectl
.Nd control utility for bhyve instances
.Sh SYNOPSIS
.Nm
.Fl -vm= Ns Ar <vmname>
.Op Fl -create
.Op Fl -destroy
.Op Fl -get-stats
.Op Fl -inject-nmi
.Op Fl -force-reset
.Op Fl -force-poweroff
.Op Fl -checkpoint= Ns Ar <file>
.Op Fl -rundir= Ns Ar <path>
.Op Fl -suspend= Ns Ar <file>
.Op Fl -pci-add= Ns Ar emulation Ns Op Cm \&, Ns Ar conf
.Op Fl -pci-remove= Ns Ar slot
.Sh DESCRIPTION
The
.Nm
command is a control utility for active
.Xr bhyve 8
virtual machine instances.
.Pp
The user-facing options are as follows:
.Bl -tag -width "--checkpoint=<file>"
.It Fl -vm= Ns Ar <vmname>
Operate on the virtual machine
.Ar <vmname> .
.It Fl -create
Create the specified VM.
.It Fl -destroy
Destroy the specified VM.
.It Fl -get-stats
Retrieve statistics for the specified VM.
.It Fl -inject-nmi
Inject a non-maskable interrupt (NMI) into the VM.
.It Fl -force-reset
Force the VM to reset.
.It Fl -force-poweroff
Force the VM to power off.
.It Fl -checkpoint= Ns Ar <file>
Save a snapshot of a virtual machine.
The guest memory contents are saved in the file given in
.Ar <file> .
The guest device and vCPU state are saved in the file
.Ar <file>.kern .
.It Fl -suspend= Ns Ar <file>
Save a snapshot of a virtual machine similar to
.Fl -checkpoint .
The virtual machine will terminate after the snapshot has been
saved.
.It Fl -rundir= Ns Ar <path>
Specify path to the directory containing the checkpoint socket.
If not specified,
.Pa /var/run/bhyve
is used.
.It Fl -pci-add= Ns Ar emulation Ns Op Cm \&, Ns Ar conf
Add an emulated PCI device to a running virtual machine.
The
.Ar emulation
and
.Ar conf
arguments follow the same format as the
.Xr bhyve 8
.Fl s
flag.
See the
.Xr bhyve 8
.Sx "PCI EMULATION"
section for available options for the
.Ar emulation
and
.Ar conf
arguments.
.It Fl -pci-remove= Ns Ar slot
Request removal of a previously added emulated PCI device.
See the
.Xr bhyve 8
.Sx "IPC COMMANDS"
section for available formats for the
.Ar slot
argument
.El
.Pp
.Em Note :
Most
.Nm
flags are intended for querying and setting
the state of an active instance.
These commands are intended for development purposes,
and are not documented here.
A complete list can be obtained by executing
.Nm
without any arguments.
.Sh EXIT STATUS
.Ex -std
.Sh EXAMPLES
Destroy the VM called fbsd10:
.Pp
.Dl bhyvectl --vm=fbsd10 --destroy
.Pp
Running VMs will be visible in
.Pa /dev/vmm/ .
.Pp
Add an 'e1000' PCI device to the 'fbsd16' VM:
.Pp
.Dl bhyvectl --vm=fbsd10 --pci-add=e1000,tap0
.Pp
Remove a previously hotplugged PCI device from the 'fbsd16' VM:
.Pp
.Dl bhyvectl --vm=fbsd10 --pci-remove=0:3:0
.Sh COMPATIBILITY
The snapshot file format is not yet stable and is subject to future changes.
Backwards compatibility support for the current snapshot file format is not
guaranteed when future changes are made.
.Sh SEE ALSO
.Xr bhyve 8 ,
.Xr bhyveload 8
.Sh HISTORY
The
.Nm
command first appeared in
.Fx 10.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
utility was written by
.An Peter Grehan
and
.An Neel Natu .
